Revit 2026 API

# TransformOrigin Property

---

Defines the origin of the old coordinate system in the new coordinate system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Origin { get; set; }
```
```vb
Public Property Origin As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Origin : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the transform is internally marked as read-only. |

This corresponds to the fourth column vector of the conventional 3x4 matrix representation. Also, this is the translation component of the transformation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace